# Словари для дальнейшнего применения

#словарь с типами(видами) телефона
phone_number_type_dictionary = \
    {
        0 : "Неопределен" ,
        1 : "Рабочий" ,
        2 : "Домашний",
        3 : "Личный",
        4 : "Дополнительный" 
    }
#словарь полов(муж/жен и тд)
gender_dictionary = \
    {
        0 : "Не указано" ,
        1 : "Мужской" ,
        2 : "Женский",
        3 : "Другое"
    }
#словарь с типами контактов (друг/семья/коллега и тд)
contact_type_dictionary = \
    {
        0 : "Не указано" ,
        1 : "Знакомый" ,
        2 : "Друг",
        3 : "Семья",
        4 : "Коллега" ,
        5 : "Другое" 
    }
#словарь с графами для описания телефона
phone_number_dictionary = \
    {
        1 : "Вид номера телефона" ,
        2 : "Номер телефона" ,
        3 : "Комментарий" ,
        4 : "E-mail "  
    } 
#словарь с датой рождения
birthday_date_dictionary = \
    {
        1: "День",
        2: "Месяц",
        3: "Год",
    }

#словарь с адресом проживания
addres_dictionary = \
    {
        1: "Страна",
        2: "Регион(Область/Штат)",
        3: "Населенный пункт",
        4: "Улица",
        5: "Дом",
        6: "Квартира"
    }

# словарь с описанием места работы
work_place_dictionary = \
    {
        1: "Наименование компании",
        2: "Должность",
        3: "Департамент",
        4: "Отдел"
    }
#словарь с описанием контакта (ФИО,пол,возраст и тд)
information_contact_dictionary = \
    {
        1 : "Фамилия" ,
        2 : "Имя" ,
        3 : "Отчество (при наличии)" ,
        4 : "Тип контакта" ,
        5 : "Пол" ,
        6 : "Дата рождения" ,
        7 : "Адрес" ,
        8 : "Место работы" ,
        9 : "Дополнительная информация"
    }